In [2]:
import pandas as pd
import numpy as np

# Series

In [28]:
labels=['x','y','z']
arr=[1,'t','a']
arr_np=np.array(arr)
d={'d1':'a','d2':2,'d3':'b'}

In [29]:
ser1=pd.Series(data=arr,index=labels)
ser1

x    1
y    t
z    a
dtype: object

In [30]:
ser2=pd.Series(arr)
ser2

0    1
1    t
2    a
dtype: object

In [31]:
ser3=pd.Series(d)
ser3

d1    a
d2    2
d3    b
dtype: object

In [32]:
ser4=pd.Series(data=[1,2,3,4],index=['level1','level2','level3','level4'])
ser4

level1    1
level2    2
level3    3
level4    4
dtype: int64

In [33]:
ser4['level4']

4

In [35]:
ser4[0:2]

level1    1
level2    2
dtype: int64

In [37]:
ser3.loc['d1']

'a'

In [39]:
ser3.iloc[1]

2

In [40]:
ser3['d4']=8
ser3

d1    a
d2    2
d3    b
d4    8
dtype: object

In [41]:
ser3.replace(to_replace=8,value=99,inplace=True)
ser3

d1     a
d2     2
d3     b
d4    99
dtype: object

In [42]:
ser3.index=['d5','d6','d7','d8']
ser3

d5     a
d6     2
d7     b
d8    99
dtype: object

In [43]:
ser3.rename(index={'d5':'d9'},inplace=True)
ser3

d9     a
d6     2
d7     b
d8    99
dtype: object

In [44]:
ser4.append(ser3)

level1     1
level2     2
level3     3
level4     4
d9         a
d6         2
d7         b
d8        99
dtype: object

In [46]:
ser4.append(ser3,ignore_index=True)

0     1
1     2
2     3
3     4
4     a
5     2
6     b
7    99
dtype: object

In [47]:
del(ser4['level4'])
ser4

level1    1
level2    2
level3    3
dtype: int64

In [48]:
ser3.drop(['d7','d8'],inplace=False)

d9    a
d6    2
dtype: object

# Dataframes

In [14]:
df=pd.DataFrame(data=np.random.randint(1,20,(5,4)),index='r1.r2.r3.r4.r5'.split('.'),columns='c1.c2.c3.c4'.split('.'))
df

    c1  c2  c3  c4
r1   2  10  16  19
r2   1  13  15  19
r3  12  12   3   5
r4   6   7  12   2
r5   8  12  10   5

*Selection and Indexing*

In [13]:
df['c1']

r1    12
r2    10
r3     6
r4    12
r5     2
Name: c1, dtype: int32

In [14]:
df[['c1','c2']]

    c1  c2
r1  12  15
r2  10  15
r3   6   9
r4  12  15
r5   2   9

In [15]:
df['c5']=np.random.randint(10,30,5)
df

    c1  c2  c3  c4  c5
r1  12  15  19  13  13
r2  10  15  10   5  23
r3   6   9   4  16  20
r4  12  15  12   5  27
r5   2   9  14  11  14

In [17]:
df.drop('c5',axis=1)

    c1  c2  c3  c4
r1  12  15  19  13
r2  10  15  10   5
r3   6   9   4  16
r4  12  15  12   5
r5   2   9  14  11

In [18]:
df

    c1  c2  c3  c4  c5
r1  12  15  19  13  13
r2  10  15  10   5  23
r3   6   9   4  16  20
r4  12  15  12   5  27
r5   2   9  14  11  14

In [21]:
df.drop('c5',axis=1,inplace=True)
df

    c1  c2  c3  c4
r1  12  15  19  13
r2  10  15  10   5
r3   6   9   4  16
r4  12  15  12   5
r5   2   9  14  11

In [22]:
df.drop('r1')

    c1  c2  c3  c4
r2  10  15  10   5
r3   6   9   4  16
r4  12  15  12   5
r5   2   9  14  11

In [23]:
df

    c1  c2  c3  c4
r1  12  15  19  13
r2  10  15  10   5
r3   6   9   4  16
r4  12  15  12   5
r5   2   9  14  11

*Select Rows*

In [24]:
df.loc['r2']

c1    10
c2    15
c3    10
c4     5
Name: r2, dtype: int32

In [19]:
df.loc['r2',['c2','c3']]

c2    13
c3    15
Name: r2, dtype: int32

In [25]:
df.iloc[2]

c1     6
c2     9
c3     4
c4    16
Name: r3, dtype: int32

In [26]:
df.loc['r1','c4']

13

In [15]:
df.iloc[:2,:2]

    c1  c2
r1   2  10
r2   1  13

In [28]:
df[['c1','c2']]

    c1  c2
r1  12  15
r2  10  15
r3   6   9
r4  12  15
r5   2   9

In [29]:
df.loc[['r1','r2'],['c1','c2','c3']]

    c1  c2  c3
r1  12  15  19
r2  10  15  10

In [31]:
df.loc[:,['c1','c2','c3']]

    c1  c2  c3
r1  12  15  19
r2  10  15  10
r3   6   9   4
r4  12  15  12
r5   2   9  14

*Conditional*

In [24]:
df

    c1  c2  c3  c4
r1   2  10  16  19
r2   1  13  15  19
r3  12  12   3   5
r4   6   7  12   2
r5   8  12  10   5

In [33]:
df%2==0

      c1     c2     c3     c4
r1  True  False  False  False
r2  True  False   True  False
r3  True  False   True   True
r4  True  False   True  False
r5  True  False   True  False

In [20]:
df.loc[df['c1']>10]

    c1  c2  c3  c4
r3  12  12   3   5

In [22]:
df[df%2==0]

      c1    c2    c3   c4
r1   2.0  10.0  16.0  NaN
r2   NaN   NaN   NaN  NaN
r3  12.0  12.0   NaN  NaN
r4   6.0   NaN  12.0  2.0
r5   8.0  12.0  10.0  NaN

In [23]:
df[df['c1']>10]

    c1  c2  c3  c4
r3  12  12   3   5

In [36]:
df[df['c1']>10].loc['r1']

c1    12
c2    15
c3    19
c4    13
Name: r1, dtype: int32

In [37]:
df[df['c1']>10]['c3']

r1    19
r4    12
Name: c3, dtype: int32

In [38]:
df[df['c1']>10][['c3']]

    c3
r1  19
r4  12

In [40]:
df[(df['c1']>10) & (df['c3']>12)]

    c1  c2  c3  c4
r1  12  15  19  13

# More Index

In [41]:
df

    c1  c2  c3  c4
r1  12  15  19  13
r2  10  15  10   5
r3   6   9   4  16
r4  12  15  12   5
r5   2   9  14  11

In [43]:
df.reset_index()

  index  c1  c2  c3  c4
0    r1  12  15  19  13
1    r2  10  15  10   5
2    r3   6   9   4  16
3    r4  12  15  12   5
4    r5   2   9  14  11

In [44]:
df

    c1  c2  c3  c4
r1  12  15  19  13
r2  10  15  10   5
r3   6   9   4  16
r4  12  15  12   5
r5   2   9  14  11

In [45]:
df['rowid']='id1 id2 id3 id4 id5'.split()
df

    c1  c2  c3  c4 rowid
r1  12  15  19  13   id1
r2  10  15  10   5   id2
r3   6   9   4  16   id3
r4  12  15  12   5   id4
r5   2   9  14  11   id5

In [47]:
df.set_index('rowid',inplace=True)
df

       c1  c2  c3  c4
rowid
id1    12  15  19  13
id2    10  15  10   5
id3     6   9   4  16
id4    12  15  12   5
id5     2   9  14  11

*<r>Multi Index----------Left</r>*

# Missing Data

In [54]:
df1=pd.DataFrame({'a':[1,2,np.nan],'b':[np.nan,5,6],'c':[8,9,10]})
df1

     a    b   c
0  1.0  NaN   8
1  2.0  5.0   9
2  NaN  6.0  10

In [55]:
df1.fillna('blanks')

        a       b   c
0       1  blanks   8
1       2       5   9
2  blanks       6  10

In [56]:
df1

     a    b   c
0  1.0  NaN   8
1  2.0  5.0   9
2  NaN  6.0  10

In [57]:
df1.dropna()

     a    b  c
1  2.0  5.0  9

In [58]:
df1.dropna(axis=1)

    c
0   8
1   9
2  10

In [62]:
df1.dropna(thresh=3)

     a    b  c
1  2.0  5.0  9

In [63]:
df1

     a    b   c
0  1.0  NaN   8
1  2.0  5.0   9
2  NaN  6.0  10

In [67]:
df1['b'].fillna(df1['b'].mean(),inplace=True)

In [68]:
df1

     a    b   c
0  1.0  5.5   8
1  2.0  5.0   9
2  NaN  6.0  10

# GroupBy

In [3]:
data={
    'ORG':['Sales','Marketing','IT','Marketing','IT','Sales'],
    'Users':['user1','user2','user3','user4','user5','user6'],
    'Earn':[200,300,110,800,800,200]
}
df=pd.DataFrame(data)
df

   Earn        ORG  Users
0   200      Sales  user1
1   300  Marketing  user2
2   110         IT  user3
3   800  Marketing  user4
4   800         IT  user5
5   200      Sales  user6

In [14]:
df_1=df.groupby('ORG')
df_1.head()

   Earn        ORG  Users
0   200      Sales  user1
1   300  Marketing  user2
2   110         IT  user3
3   800  Marketing  user4
4   800         IT  user5
5   200      Sales  user6

In [15]:
df_1.mean()

           Earn
ORG
IT          455
Marketing   550
Sales       200

In [16]:
df_1.get_group('IT')

   Earn ORG  Users
2   110  IT  user3
4   800  IT  user5

In [17]:
df_1.get_group('IT')['Earn']

2    110
4    800
Name: Earn, dtype: int64

In [19]:
df_1.count()

           Earn  Users
ORG
IT            2      2
Marketing     2      2
Sales         2      2

In [20]:
df_1.min()

           Earn  Users
ORG
IT          110  user3
Marketing   300  user2
Sales       200  user1

In [23]:
df_2=df.groupby(['ORG','Users'])
df_2.head()

   Earn        ORG  Users
0   200      Sales  user1
1   300  Marketing  user2
2   110         IT  user3
3   800  Marketing  user4
4   800         IT  user5
5   200      Sales  user6

In [24]:
df_2.count()

                 Earn
ORG       Users
IT        user3     1
          user5     1
Marketing user2     1
          user4     1
Sales     user1     1
          user6     1

In [25]:
df_2.sum()

                 Earn
ORG       Users
IT        user3   110
          user5   800
Marketing user2   300
          user4   800
Sales     user1   200
          user6   200

In [26]:
df_2.mean()

                 Earn
ORG       Users
IT        user3   110
          user5   800
Marketing user2   300
          user4   800
Sales     user1   200
          user6   200

In [28]:
df_2.get_group(('IT','user3'))

   Earn
2   110

In [29]:
df_2.describe()

                 Earn
                count   mean std    min    25%    50%    75%    max
ORG       Users
IT        user3   1.0  110.0 NaN  110.0  110.0  110.0  110.0  110.0
          user5   1.0  800.0 NaN  800.0  800.0  800.0  800.0  800.0
Marketing user2   1.0  300.0 NaN  300.0  300.0  300.0  300.0  300.0
          user4   1.0  800.0 NaN  800.0  800.0  800.0  800.0  800.0
Sales     user1   1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
          user6   1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0

In [31]:
df_2.describe().transpose()

ORG            IT        Marketing         Sales
Users       user3  user5     user2  user4  user1  user6
Earn count    1.0    1.0       1.0    1.0    1.0    1.0
     mean   110.0  800.0     300.0  800.0  200.0  200.0
     std      NaN    NaN       NaN    NaN    NaN    NaN
     min    110.0  800.0     300.0  800.0  200.0  200.0
     25%    110.0  800.0     300.0  800.0  200.0  200.0
     50%    110.0  800.0     300.0  800.0  200.0  200.0
     75%    110.0  800.0     300.0  800.0  200.0  200.0
     max    110.0  800.0     300.0  800.0  200.0  200.0

In [32]:
df_1.describe().transpose()

ORG                 IT   Marketing  Sales
Earn count    2.000000    2.000000    2.0
     mean   455.000000  550.000000  200.0
     std    487.903679  353.553391    0.0
     min    110.000000  300.000000  200.0
     25%    282.500000  425.000000  200.0
     50%    455.000000  550.000000  200.0
     75%    627.500000  675.000000  200.0
     max    800.000000  800.000000  200.0

# Merging, Joining, and Concatenating

In [35]:
df1=pd.DataFrame({
    'A':[1,2,3,4],
    'B':[4,5,6,7],
    'C':[8,9,10,11]
},index=[0,1,2,3])
df1

   A  B   C
0  1  4   8
1  2  5   9
2  3  6  10
3  4  7  11

In [36]:
df2=pd.DataFrame({
    'A':[1,2,3,4],
    'B':[4,5,6,7],
    'C':[8,9,10,11]
},index=[4,5,6,7])
df2

   A  B   C
4  1  4   8
5  2  5   9
6  3  6  10
7  4  7  11

In [37]:
df3=pd.DataFrame({
    'A':[1,2,3,4],
    'B':[4,5,6,7],
    'C':[8,9,10,11]
},index=[8,9,10,11])
df3

    A  B   C
8   1  4   8
9   2  5   9
10  3  6  10
11  4  7  11

In [39]:
pd.concat([df1,df2,df3])

    A  B   C
0   1  4   8
1   2  5   9
2   3  6  10
3   4  7  11
4   1  4   8
5   2  5   9
6   3  6  10
7   4  7  11
8   1  4   8
9   2  5   9
10  3  6  10
11  4  7  11

In [40]:
pd.concat([df1,df2,df3],axis=1)

      A    B     C    A    B     C    A    B     C
0   1.0  4.0   8.0  NaN  NaN   NaN  NaN  NaN   NaN
1   2.0  5.0   9.0  NaN  NaN   NaN  NaN  NaN   NaN
2   3.0  6.0  10.0  NaN  NaN   NaN  NaN  NaN   NaN
3   4.0  7.0  11.0  NaN  NaN   NaN  NaN  NaN   NaN
4   NaN  NaN   NaN  1.0  4.0   8.0  NaN  NaN   NaN
5   NaN  NaN   NaN  2.0  5.0   9.0  NaN  NaN   NaN
6   NaN  NaN   NaN  3.0  6.0  10.0  NaN  NaN   NaN
7   NaN  NaN   NaN  4.0  7.0  11.0  NaN  NaN   NaN
8   NaN  NaN   NaN  NaN  NaN   NaN  1.0  4.0   8.0
9   NaN  NaN   NaN  NaN  NaN   NaN  2.0  5.0   9.0
10  NaN  NaN   NaN  NaN  NaN   NaN  3.0  6.0  10.0
11  NaN  NaN   NaN  NaN  NaN   NaN  4.0  7.0  11.0

# Merge

In [41]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [42]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [49]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [44]:
pd.merge(left,right,how='inner',on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [50]:
pd.merge(left,right,how='outer',on=['key1','key2'],indicator=True)

     A    B key1 key2    C    D      _merge
0   A0   B0   K0   K0   C0   D0        both
1   A1   B1   K0   K1  NaN  NaN   left_only
2   A2   B2   K1   K0   C1   D1        both
3   A2   B2   K1   K0   C2   D2        both
4   A3   B3   K2   K1  NaN  NaN   left_only
5  NaN  NaN   K2   K0   C3   D3  right_only

In [46]:
pd.merge(left,right,how='right',on=['key1','key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [47]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [48]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [49]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [50]:
left.join(right,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

# Operations

In [25]:
df_n=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[11,11,np.nan,44,77],
    'C':[1,2,4,4,np.nan],
    'D':['aa','bb','cc','dd','ee']
})
df_n

   A     B    C   D
0  1  11.0  1.0  aa
1  2  11.0  2.0  bb
2  3   NaN  4.0  cc
3  4  44.0  4.0  dd
4  5  77.0  NaN  ee

In [54]:
df_n['B'].unique()

array([11., nan, 44., 77.])

In [55]:
df_n['B'].nunique()

3

In [57]:
df_n['C'].value_counts()

4.0    2
2.0    1
1.0    1
Name: C, dtype: int64

In [27]:
df_n['C'].value_counts(ascending=True)

1.0    1
2.0    1
4.0    2
Name: C, dtype: int64

In [61]:
df_n['N']=df_n['C'].apply(lambda x:x**2)
df_n

   A     B    C   D     N
0  1  11.0  1.0  aa   1.0
1  2  11.0  2.0  bb   4.0
2  3   NaN  4.0  cc  16.0
3  4  44.0  4.0  dd  16.0
4  5  77.0  NaN  ee   NaN

In [60]:
del df_n['N']
df_n

   A     B    C   D
0  1  11.0  1.0  aa
1  2  11.0  2.0  bb
2  3   NaN  4.0  cc
3  4  44.0  4.0  dd
4  5  77.0  NaN  ee

In [62]:
df_n.sum()

A            15
B           143
C            11
D    aabbccddee
N            37
dtype: object

In [26]:
df_n.sum(axis=1)

0    13.0
1    15.0
2     7.0
3    52.0
4    82.0
dtype: float64

In [63]:
df_n['C'].sum()

11.0

In [66]:
df_n.index

RangeIndex(start=0, stop=5, step=1)

In [67]:
df_n.columns

Index(['A', 'B', 'C', 'D', 'N'], dtype='object')

In [68]:
df_n.columns.tolist()

['A', 'B', 'C', 'D', 'N']

In [69]:
df_n.sort_values(by='C')

   A     B    C   D     N
0  1  11.0  1.0  aa   1.0
1  2  11.0  2.0  bb   4.0
2  3   NaN  4.0  cc  16.0
3  4  44.0  4.0  dd  16.0
4  5  77.0  NaN  ee   NaN

In [71]:
df_n.dropna()

   A     B    C   D     N
0  1  11.0  1.0  aa   1.0
1  2  11.0  2.0  bb   4.0
3  4  44.0  4.0  dd  16.0

In [72]:
df_n

   A     B    C   D     N
0  1  11.0  1.0  aa   1.0
1  2  11.0  2.0  bb   4.0
2  3   NaN  4.0  cc  16.0
3  4  44.0  4.0  dd  16.0
4  5  77.0  NaN  ee   NaN

In [73]:
df_n['B'].fillna(df_n['B'].mean())

0    11.00
1    11.00
2    35.75
3    44.00
4    77.00
Name: B, dtype: float64

In [3]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df_n1 = pd.DataFrame(data)

In [4]:
df_n1

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [5]:
df_n1.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [8]:
d={"Month":['Jan','Feb','Mar','Apr'],
  "Account":['Sales','Marketing','Sales','Sales'],
  "Sales":[100,200,300,400]}
df_p=pd.DataFrame(d)
df_p

     Account Month  Sales
0      Sales   Jan    100
1  Marketing   Feb    200
2      Sales   Mar    300
3      Sales   Apr    400

In [9]:
df_pivot=df_p.pivot(index='Account',values='Sales',columns='Month')
df_pivot

Month        Apr    Feb    Jan    Mar
Account
Marketing    NaN  200.0    NaN    NaN
Sales      400.0    NaN  100.0  300.0

In [11]:
df_pivot.sum(axis=1)

Account
Marketing    200.0
Sales        800.0
dtype: float64

In [19]:
df_pivot1=df_p.pivot_table(index='Account',values='Sales',columns='Month',aggfunc='max')
df_pivot1

Month        Apr    Feb    Jan    Mar
Account
Marketing    NaN  200.0    NaN    NaN
Sales      400.0    NaN  100.0  300.0

In [20]:
pd.crosstab(index=df_p['Account'],columns=df_p['Sales'])

Sales      100  200  300  400
Account
Marketing    0    1    0    0
Sales        1    0    1    1

# Data Input and Output

*CSV*

In [2]:
df_1=pd.read_csv('train.csv')
df_1.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,12,2008,WD,Normal,250000

In [88]:
# df_1.columns.tolist()

In [4]:
cols=df_1.columns.tolist()[:10]
cols

['Id',
 'MSSubClass',
 'MSZoning',
 'LotFrontage',
 'LotArea',
 'Street',
 'Alley',
 'LotShape',
 'LandContour',
 'Utilities']

In [5]:
df_mod=df_1[cols].copy()
df_mod.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub

In [91]:
df_mod.to_csv('mod_train.csv',index=False)

# Excel Output

In [6]:
df_mod.to_excel('mod_excel.xlsx',sheet_name='Page1')

# Read From Excel

In [8]:
df_excel=pd.read_excel('mod_excel.xlsx',sheet_name='Page1')
df_excel.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub

# SQL

*The key functions are:*

read_sql_table(table_name, con[, schema, ...])
Read SQL database table into a DataFrame.

read_sql_query(sql, con[, index_col, ...])
Read SQL query into a DataFrame.

read_sql(sql, con[, index_col, ...])
Read SQL query or database table into a DataFrame.

DataFrame.to_sql(name, con[, flavor, ...])
Write records stored in a DataFrame to a SQL database.*

In [9]:
from sqlalchemy import create_engine

In [10]:
engine = create_engine('sqlite:///:memory:')

In [11]:
df_excel.to_sql('data', engine)

In [12]:
sql_df = pd.read_sql('data',con=engine)

In [13]:
sql_df.head()

,index,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities
0,0,1,60,RL,65.0,8450,Pave,None,Reg,Lvl,AllPub
1,1,2,20,RL,80.0,9600,Pave,None,Reg,Lvl,AllPub
2,2,3,60,RL,68.0,11250,Pave,None,IR1,Lvl,AllPub
3,3,4,70,RL,60.0,9550,Pave,None,IR1,Lvl,AllPub
4,4,5,60,RL,84.0,14260,Pave,None,IR1,Lvl,AllPub

## Managing Dates

In [21]:
import datetime as dt

In [22]:
date=dt.datetime(year=2019,month=8,day=6,hour=20,minute=35)
date

datetime.datetime(2019, 8, 6, 20, 35)

In [23]:
print(date)

2019-08-06 20:35:00

In [24]:
ts=pd.Timestamp('2019-08-06 00:00:00')

In [25]:
ts.day

6

In [26]:
ts.month

8

In [28]:
ts+pd.Timedelta('10 days')

Timestamp('2019-08-16 00:00:00')

In [29]:
s_n=pd.Series(['2019-1-1','2019-2-1','2019-3-1','2019-4-1'])
s_n

0    2019-1-1
1    2019-2-1
2    2019-3-1
3    2019-4-1
dtype: object

In [30]:
s_date=pd.to_datetime(s_n)

In [33]:
s_date

0   2019-01-01
1   2019-02-01
2   2019-03-01
3   2019-04-01
dtype: datetime64[ns]

In [35]:
s_date.dt.weekday

0    1
1    4
2    4
3    0
dtype: int64

In [36]:
s_date.dt.month

0    1
1    2
2    3
3    4
dtype: int64

In [38]:
s_date.dt.weekday

0    1
1    4
2    4
3    0
dtype: int64

In [40]:
dt1=pd.Series(pd.date_range(start='2019-08-06',periods=10,freq='24H'))
dt1

0   2019-08-06
1   2019-08-07
2   2019-08-08
3   2019-08-09
4   2019-08-10
5   2019-08-11
6   2019-08-12
7   2019-08-13
8   2019-08-14
9   2019-08-15
dtype: datetime64[ns]

## Processing Data

In [41]:
data_d={
    "group":['a','b','a','a','b','b','b','c'],
    "data":[1,2,5,1,9,3,8,0]
}
df_d=pd.DataFrame(data_d)
df_d

   data group
0     1     a
1     2     b
2     5     a
3     1     a
4     9     b
5     3     b
6     8     b
7     0     c

In [43]:
df_d.sort_values(by=['group','data'],ascending=[False,True])

   data group
7     0     c
1     2     b
5     3     b
6     8     b
4     9     b
0     1     a
3     1     a
2     5     a

In [45]:
df_2=pd.DataFrame({"k1":["one"]*3+["two"]*4,"k2":[1,0,3,6,4,8,1]})
df_2

    k1  k2
0  one   1
1  one   0
2  one   3
3  two   6
4  two   4
5  two   8
6  two   1

In [46]:
df_2.sort_values(by="k2")

    k1  k2
1  one   0
0  one   1
6  two   1
2  one   3
4  two   4
3  two   6
5  two   8

In [47]:
df_2.drop_duplicates(subset='k1')

    k1  k2
0  one   1
3  two   6

In [48]:
df_2

    k1  k2
0  one   1
1  one   0
2  one   3
3  two   6
4  two   4
5  two   8
6  two   1

In [51]:
mapping={
    "one":10000,
    "two":20000
}

In [54]:
df_2['k3']=df_2['k1'].map(mapping)
df_2

    k1  k2     k3
0  one   1  10000
1  one   0  10000
2  one   3  10000
3  two   6  20000
4  two   4  20000
5  two   8  20000
6  two   1  20000

In [56]:
df_5=pd.DataFrame({"col1":np.random.randint(1,5,5),'col2':np.random.randint(1,5,5)})
df_5

   col1  col2
0     3     3
1     4     1
2     4     3
3     4     4
4     3     3

In [57]:
df_6=df_5.assign(r=df_5['col2']*2)
df_6

   col1  col2  r
0     3     3  6
1     4     1  2
2     4     3  6
3     4     4  8
4     3     3  6

In [58]:
df_7=pd.DataFrame({
    'Dept':['Sales','Marketing','Overall'],
    'Figures':[10,20,30]
})
df_7

        Dept  Figures
0      Sales       10
1  Marketing       20
2    Overall       30

In [61]:
bins=pd.cut(df_7['Figures'],[df_7['Figures'].min(),df_7['Figures'].mean(),df_7['Figures'].max()])
bins

0             NaN
1    (10.0, 20.0]
2    (20.0, 30.0]
Name: Figures, dtype: category
Categories (2, interval[float64]): [(10.0, 20.0] < (20.0, 30.0]]

In [65]:
bins=pd.cut(df_7['Figures'],[df_7['Figures'].min(),df_7['Figures'].mean(),df_7['Figures'].max()],labels=['low','medium'],include_lowest=True)
bins

0       low
1       low
2    medium
Name: Figures, dtype: category
Categories (2, object): [low < medium]

In [66]:
df_7['n']=bins
df_7

        Dept  Figures       n
0      Sales       10     low
1  Marketing       20     low
2    Overall       30  medium

In [67]:
df_data=pd.DataFrame({
    'col1':[np.nan,1,0,np.nan],
    'col2':[1,1,1,np.nan]
})
df_data

   col1  col2
0   NaN   1.0
1   1.0   1.0
2   0.0   1.0
3   NaN   NaN

In [68]:
df_data.isnull()

    col1   col2
0   True  False
1  False  False
2  False  False
3   True   True

In [69]:
df_data.isnull().any()

col1    True
col2    True
dtype: bool

In [70]:
df_data.isnull().all()

col1    False
col2    False
dtype: bool

In [71]:
df_data.isnull().any(axis=1)

0     True
1    False
2    False
3     True
dtype: bool

In [73]:
s_l=pd.Series(['A','b','CC','Dd','EeE'])
s_l

0      A
1      b
2     CC
3     Dd
4    EeE
dtype: object

In [74]:
s_l.str.lower()

0      a
1      b
2     cc
3     dd
4    eee
dtype: object

In [76]:
s_l.str.len()

0    1
1    1
2    2
3    2
4    3
dtype: int64

In [79]:
s_l.str.replace("e","FF")
s_l

0      A
1      b
2     CC
3     Dd
4    EeE
dtype: object